{
  "data": [
    {
      "id": 0,
      "url":"/albums/0.png",
      "artist": "RiTchie",
      "title": "Triple Digits (112)",
      "year": "2024",
      "rating": 4,
      "description": "In his time with Injury Reserve RiTchie has proven himself to be a remarkably talented MC with a unique style and flavour, and his debut solo work is packed with that same style just with more potency. RiTchie and the small set of co-performers all do great work and deliver the package with a delightfully bizarre energy while also just being really funny (especially Aminé on 'Dizzy').RiTchie also helms production on a number of the tracks here and the production is great, some truly mind-melting stuff on these beats. The only real issue I have is there are a lot of interludes on here and most of them don't do much on their own, but they add to the bizarre atmosphere of the whole record in a way that makes me not mind their presence. A pretty exceptional first work from RiTchie, and while I still anxiously wait for what will come next from By Storm, for now, this album has absolutely satisfied me.",
      "overall": 3.58,
      "ratings": 1403,
      "genres": "Experimental Hip Hop, Abstract Hip Hop ",
      "descriptors": "surreal, male vocalist, eclectic, quirky, playful, futuristic, humorous, introspective, chaotic, complex, sampling, boastful, psychedelic, atmospheric, abstract, rhythmic, dense, avant-garde, uncommon time signatures "
    },
    {
      "id": 1,
      "url":"albums/1.png",
      "artist": "Frail Body",
      "title": "Artificial Bouquet",
      "year": "2024",
      "rating": 4,
      "description": "In 2019, Frail Body released A Brief Memoriam, their first full-length studio album. Living up to its name, the aforementioned record barely cracked twenty minutes and yet still managed to endure as one of the most distinct screamo albums of the past few years. The themes of grieving, acceptance, and death surrounding that record made it one of the most earnest 'extreme music' albums of its given year. Five years later, the band follow it up with their sophomore studio album. Artificial Bouquet, Frail Body's latest studio album, allows them to expand upon their sound and give the listener more material to sink their teeth into while also creating a soundscape that is genuinely beautiful at times. Artificial Bouquet feels like Frail Body at their absolute best on all musical fronts. There are almost countless small moments here that add up to a record that is beautifully detailed to a greater extent than most would likely expect. The various moments where Lowell Shaffer's guitar work slows down and becomes the melodic focus of the record as he progressively becomes even more raw in his screams can be absolutely stunning. In fact, the guitar tone on tracks like 'Horizon Line' provides a certain melancholic warmth that nicely contrasts and works alongside the naturally cold nature of the sonic palette on display here. Shaffer is more than just an intense leader that suits Frail Body's overall style. Throughout Artificial Bouquet, he can often feel possessed by the spirit of a deeply wounded being crying out its darkest thoughts into something that feels morbidly beautiful. The bass tone throughout the record is tight and punchy as well, though Nicholas Clemenson's drumming should not be underestimated either. The percussion that he provides on tracks like 'Critique Programme' and 'Runaway,' the latter of which being especially notable due to the aforementioned Shaffer simultaneously spouting some of the most striking lyrics on the record with 'And if my memory loses every day/Then how else can we speak?' is outright explosive and provides a degree of chaos that beautifully adds to the already apocalyptic nature of Artificial Bouquet. From this entirely instrumental standpoint alone, Artificial Bouquet is Frail Body putting every ounce of their souls into their music. The instrumentation here is packed with emotion both in the most dense wall-of-sound moments (a quality beautifully provided by producer Pete Grossmann) and the most stripped-back melodic moments alike, with the final record feeling every bit as mournful as it does cathartic. ",
      "overall": 3.78,
      "ratings": 1365,
      "genres": "Screamo, Post-Metal, Blackgaze, Emoviolence",
      "descriptors": "death, ethereal, male vocalist, heavy, dense, passionate, energetic, noisy, androgynous vocals, atmospheric, raw, sentimental, sombre, depressive, chaotic, funereal, melodic "
    },
    {
      "id": 2,
      "url":"albums/2.png",
      "artist": "R.E.M.",
      "title": "Murmur",
      "year": "1983",
      "rating": 4,
      "description": "Murmur is a cohesive and dazzlingly bright debut from a band that would continue to expand on this sound in creative ways for years to come. This maturity partially stems from their already having worked through the kinks on their equally gorgeous Chronic Town EP, but that doesn't take away from the fact that Murmur is a masterful recording and overflowing with elegantly arranged songs. It is also, in my view, the most grounded yet cryptic record they ever released. The whole album is brilliant with the first side hitting quite hard from the beginning, and the second half shining particularly well with Buck's contributions on guitar. Stipe's vocal delivery is truly filled with emotion in every performance and balances perfectly with each song's storytelling arc. There are moments in between where the music lacks a necessary sense of urgency, but the majority sparkle with a delectable buzzing and resounding joy. Songs like “Moral Kiosk” or “Shaking Through” exhibit boundless potential in songwriting that foreshadow a style preceding hits from Automatic for the People. Not mentioning Stipe’s lyrics and wordplay would be silly, as they add a serious depth to what otherwise may sound like typical, albeit very catchy and layered, eighties pop music. He clearly draws from true inspiration along with a healthy sense of humor to create songs with such masterful prose. All of this backed by a band brimming with bright, springy energy give the album an endless supply of buoyant momentum and a seemingly illimitable charisma. There is an individual appeal to Murmur even within R.E.M.’s impressively varied evolution as a band within their career, but luckily we were gifted with another twenty eight wonderful years of music from the group.",
      "overall": 3.88,
      "ratings": 18151,
      "genres": "Jangle Pop, Alternative Rock Post-Punk, Paisley Underground",
      "descriptors": "cryptic, melodic, male vocalist, atmospheric, poetic, introspective, melancholic, mysterious, rhythmic, bittersweet, energetic, spring, anxious, psychedelic, hypnotic, autumn "
    },
    {
      "id": 3,
      "url":"albums/3.png",
      "artist": "Kelly Moran",
      "title": "Moves in the Field",
      "year": "2024",
      "rating": 4,
      "description": "I've always had a soft spot for piano-led modern classical music, and Kelly Moran's latest album veers away from her usual post-minimal electronic fare to embrace an impressionistic style of modern classical music. This album whimsically transitions from movement to movement without missing a beat, encapsulating a sense of optimism that's both refreshing and needed. It suggests that no matter the challenges in life, brighter days are ahead. While the album could benefit from richer textures in places and not every track is memorable, certain pieces stand out with their ability to transport you. “Moves in the Field,” for instance, takes you to a place that's sunny and bright.",
      "overall": 3.55,
      "ratings": 402,
      "genres": "Modern Classical, Post-Minimalism ",
      "descriptors": "instrumental, melodic, technical, ethereal, lush, atmospheric, mellow, mysterious, repetitive, acoustic, hypnotic, nocturnal, soft, longing, melancholic, peaceful, sentimental, lonely, warm, uplifting, minimalistic, meditative, bittersweet, soothing "
    },
    {
      "id": 4,
      "url":"albums/4.png",
      "artist": "Iron Maiden",
      "title": "Seventh Son of a Seventh Son",
      "year": "1988",
      "rating": 5,
      "description": "Here it is. The album that IRON MAIDEN had been hinting at finally coming to fruition. Steve Harris' progressive rock influences had been showing themselves from the very first album and creeping their way into each album with an ever stronger presence until on “Powerslave” the fully formed progressive behemoth “Rime Of The Ancient Mariner” reared its monstrous almost 14 minute head. Surprised was I that the next album “Somewhere In Time” was not the fully developed concept album hinted upon, but on SEVENTH SON OF A SEVENTH SON, the seventh deadly sinful studio album, all that progginess unleashes itself and in a truly satisfying way that makes this my absolute favorite MAIDEN album of their entire career and since I pretty much like every stage of their career (with the exception of the 90s) that is a major accomplishment in my book.The story and album title comes from the 1987 novel “Seventh Son” by Orson Scott Card, upon which the concept is loosely based. In ancient western myths the seventh son of a seventh son (or daughters as well) supposedly possessed heightened occultic abilities such as clairvoyance, phophetic dreams and the like. The story unfolds starting with “Moonchild” where Lucifer tries to manipulate the parents of the seventh son as to harness his powers for his own evil. The rest of the album continues through the trials and tribulations of the father of the seventh son and son himself learning to control their powers and cope with the clairvoyant visions of their world slowly being decimated by evil forces. All in all the lyrics are vague and have a definite air of mystery which makes this an album that can be interpreted in many ways.",
      "overall": 3.97,
      "ratings": 15560,
      "genres": "Heavy Metal Progressive Metal",
      "descriptors": "epic, fantasy, melodic, male vocalist, progressive, energetic, concept album, passionate, philosophical, anthemic, mysterious, technical, heavy, spiritual, complex, rhythmic "
    },
    {
      "id": 5,
      "url":"albums/5.png",
      "artist": "The Strokes",
      "title": "The New Abnormal",
      "year": "2020",
      "rating": 3,
      "description": "Manhattan’s the Strokes were the huge indie buzz of 2001 with their debut album Is This It. I liked its melodic fuzzy garage vibe, but never bothered to check out the band’s subsequent work. Two-thousand-twenty brings the aptly titled The New Abnormal that presents the Strokes in a mature, slightly experimental light. The production and arrangements are more open, less claustrophobic than on the first album. Julian Casablancas’ vocals are no longer cloaked in hazy distortion. His often melancholy lyrics are upfront and clear, with Casablancas employing a falsetto to heighten the emotional effect.Intertwining guitars remain the Strokes’ trademark, but this time vintage synthesizer sounds bolster the music’s spikey edges, which lead to some unexpected stylistic turns. “Brooklyn Bridge to Chorus” recalls the cold, dance pop of New Order, while “Bad Decisions” embellishes the guitar hook and rhythm of Modern English‘s “I Melt With You” to great effect. Choppy guitars introduce “Why Are Sundays So Depressing,” bringing it an almost Motown R&B feel. Block synth chords anchor the brooding, mournful “At the Door” until the soaring guitar and vocal chorus break through the clouds. The New Abnormal culminates with “Ode to the Mets,” a mid-tempo mellotron-backed ballad that increases in intensity to reach the final verse, a peak that alters the melody and feel of the song. ",
      "overall": 3.77,
      "ratings": 24002,
      "genres": "Indie Rock",
      "descriptors": "male vocalist, bittersweet, sentimental, melodic, melancholic, warm, passionate, atmospheric, summer, lush, urban, lonely, introspective, longing, love, mellow, romantic, existential, ethereal "
    },
    {
      "id": 6,
      "url":"albums/6.png",
      "artist": "Cindy Lee",
      "title": "Diamond Jubilee",
      "year": "2024",
      "rating": 5,
      "description": "Over the past three years, Cindy Lee has introduced a smattering of songs live and on YouTube that showcased the potential of a masterpiece coming around the corner... however not many could have guessed the length and breadth of the resulting project. Diamond Jubilee is the sound of an artist riding an incredible wave of creative energy and inspiration, fully realizing the potential of this project. At 32 tracks one might question if the quality will be inconsistent, if there will be 'misses,' or inconsequential tracks. This is not the case here. This is a masterfully curated double album of hits. There are short instrumental interludes here and there, but they all add to the flow and never weigh down the album. The highlights are evenly sprinkled through the two discs. Pat was sitting on a goldmine of musical ideas and hit songs then decided to release them all as one whopping collection... not sure there's any precedence for this kind of glow up, this kind of bombshell creative explosion of hits all simultaneously dropping on one brand new record. In the past, Cindy Lee's music has been noisy, abrasive, obscure, freaky. Globs of ghosts would disrupt the sweetness of a melody, splashes of noise would wash over the structure of a song. Pat mentioned making 'happy music' for Diamond Jubilee and indeed these songs beam with clarity, hooks, sweet melodies, gorgeous production. Pat sings in higher and lower registers, the vocals more upfront than ever before. The guitars are consistently a highlight. There are fantastic guitar hooks alllllllll over this thing. Massive ear-worms, hypnotic spidery hooks from a guitar master. ",
      "overall": 3.96,
      "ratings": 1958,
      "genres": "Hypnagogic Pop, Psychedelic Pop",
      "descriptors": "psychedelic, bittersweet, lo-fi, non-binary vocalist, LGBT, longing, love, atmospheric, androgynous vocals, Wall of Sound, noisy, romantic, melancholic, surreal, introspective, sentimental, melodic, warm, lethargic, dense, ethereal, mellow, lonely, hypnotic, raw, sombre, mysterious "
    },
    {
      "id": 7,
      "url":"albums/7.png",
      "artist": "Beyoncé",
      "title": "Cowboy Carter",
      "year": "2024",
      "rating": 4,
      "description": "I had my doubts that Cowboy Carter could live up to the high bar set by Renaissance (and Lemonade, for that matter), but I'm pleased to report that they were greatly misplaced. If anything, this Act II outshines its predecessor in terms of sheer boldness, scope, and ambition. At 78 minutes, it's certainly a commitment, but the more I listen to it, the less filler there seems to be, and the more smoothly it all flows together; the only track that loses me is 'Levi's Jeans,' but that's more of a Post Malone issue than a Beyoncé issue. The original tracks are generally dazzling, the covers are surprisingly excellent and unexpected, and even the little skits from Willie Nelson and the intros from Dolly Parton and Linda Martell work brilliantly. Especially impressive is how it doesn't lose steam toward the end... everything from 'Ya Ya; to closer 'Amen' is just top-notch, easily matching highlights such as 'Protector,' 'Bodyguard,' 'Daughter,' and those two already justifiably well-loved singles from the first half. Cowboy Carter is a sprawling epic and an often-potent personal and sociopolitical statement, but it's also just a hugely entertaining listen throughout and rife with surface pleasures. Nearly as seamless as Renaissance and a beyond-worthy follow-up, this is my favourite album so far from 2024 and will be a tough one to top.",
      "overall": 3.41,
      "ratings": 4971,
      "genres": "Country Pop Country Soul, Americana, Contemporary R&B, Contemporary Folk",
      "descriptors": "eclectic, female vocalist, passionate, boastful, playful, love, triumphant, melodic, lush, introspective, sentimental, pastoral, uplifting, conscious, sampling, warm, Christian, sexual, concept album, political, epic, progressive, sensual, psychedelic, dense "
    },
    {
      "id": 8,
      "url":"albums/8.png",
      "artist": "Vampire Weekend",
      "title": "Only God Was Above Us",
      "year": "2024",
      "rating": 2,
      "description": "There is a beautiful and incidental orchestration which often occurs along the platforms of the New York City subway. The whistles of old, oncoming trains drowning out the familiar melodies of street musicians, loudspeakers and the chatter of passing strangers. Vampire Weekend have finely rendered all of this cacophony into a sublime record, capturing what can at times be only a momentary sense of serendipity and bliss amid the noise; the alignment of all chaotic bodies into one. In his songwriting, Koenig is cosmic and down-to-earth in equal measure. He seems to realize, here more than ever, that we are not unlike the trains which carry us, going in circles and reaching the same conclusions. He illuminates the patterns which people can lock into, trying to make sense of their place in the world: “somewhere in your family tree, there was someone just like me” and “each generation makes its own apology.” Neverending circles in our pursuit of unanswerable questions.",
      "overall": 3.87,
      "ratings": 5411,
      "genres": "Indie Rock, Chamber Pop Neo-Psychedelia, Baroque Pop, Noise,Pop, Art Pop",
      "descriptors": "male vocalist, psychedelic, playful, melodic, existential, quirky, urban, dense, lush, warm, surreal, noisy, poetic, eclectic, bittersweet, melancholic, conscious, orchestral, uplifting, sentimental, abstract, energetic, introspective, philosophical, spring, sampling, rhythmic, atmospheric, longing, optimistic "
    },
    {
      "id": 9,
      "url":"albums/9.png",
      "artist": "Weyes Blood",
      "title": "Titanic Rising",
      "year": "2019",
      "rating": 4,
      "description": "It took me a little while to get my head around this one. The thing that's immediately apparent about Titanic Rising is that Weyes Blood has an earnest appreciation for musical theatre that's rare in popular music; it's unmistakably reminiscent of Rufus Wainwright, except for the occasional moment that reproduces Paul McCartney's music hall excursions ('Everyday') or recalls, weirdly, Nobuo Uematsu ('Nearer to Thee'). The problem I had with this on first listen is that, when you're making music with this kind of dramatic, theatrical sweep and grandeur, it's usually best to offset all that with lyrics that are very direct, to the point of almost being conversational. If it's an upbeat song, you should include the odd joke here and there, and if it's a ballad, your words should be clear about the source of the singer's turmoil - in both cases, the orchestration and the ornate melodies handle all of the depth and emotion, while the words have to act as the anchor. (In that sense, it's the opposite of most 'serious' rock music, where impassioned vocals and lyrics have to do the heavy emotional lifting while the more simple, repetitive music grounds things.) This is something Wainwright instinctively understood at his peak and something that has been a constant defining feature of the best work of Broadway's big hitters. What Weyes Blood does here is eschew that and go for a songcraft that's more distant and mysterious, more in line with the kind of thing you'd find in genres like dream pop or in the work of the more adventurous singer/songwriters of the last decade. On first listen, I felt like she was trying to have her cake and eat it too and that Titanic Rising was just ever so slightly too airy, lightweight, and melodramatic as a result. ",
      "overall": 3.99,
      "ratings": 29215,
      "genres": "Baroque Pop, Art Pop Progressive Pop, Dream Pop, Psychedelic Pop, Soft Rock, Singer-Songwriter",
      "descriptors": "lush, female vocalist, ethereal, melodic, longing, romantic, soft, bittersweet, love, warm, introspective, aquatic, mellow, sentimental, melancholic, epic, soothing, progressive, existential, atmospheric, poetic, psychedelic, nocturnal, passionate, spiritual, lonely, Wall of Sound "
    }
  ]
}
